In [2]:
import numpy as np
import pandas as pd

In [106]:
a =  [[1,2,3,4,5],[2,3,5,7,8]]

In [107]:
myarray = np.array(a)

In [108]:
myarray

array([[1, 2, 3, 4, 5],
       [2, 3, 5, 7, 8]])

In [122]:
df = pd.DataFrame(a,columns = ["a","b","c","d","e"], index = ["first","second"])

In [125]:
df = df.astype({"a": str,"b":float,"c":int,"d":float})

In [126]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, first to second
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      object
 1   b       2 non-null      float64
 2   c       2 non-null      int64
 3   d       2 non-null      float64
 4   e       2 non-null      int64
dtypes: float64(2), int64(2), object(1)
memory usage: 96.0+ bytes
None

In [152]:
student = [{"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
          {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":30,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":40,"Grade":"A"},
          {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":60,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":70,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},{"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"}]

In [153]:
df2 = pd.DataFrame(student)

In [98]:
df2

    Name Fname FinalMarks Grade
0  Ahmed   Ali         80     A
1  Ahmed   Ali         80     A
2  Ahmed   Ali       Fail     A
3  Ahmed   Ali         80     A
4  Ahmed   Ali         80     A

In [81]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Fname       5 non-null      object
 2   FinalMarks  5 non-null      object
 3   Grade       5 non-null      object
dtypes: object(4)
memory usage: 292.0+ bytes

In [91]:
# df2["FinalMarks"] = df2["FinalMarks"].astype(float)
df2["FinalMarks"] = pd.to_numeric(df2["FinalMarks"], errors = 'coerce')
pd.to_numeric?

Signature:
pd.to_numeric(
    arg,
    errors: 'DateTimeErrorChoices' = 'raise',
    downcast: "Literal['integer', 'signed', 'unsigned', 'float'] | None" = None,
    dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>,
)
Docstring:
Convert argument to a numeric type.

The default return dtype is `float64` or `int64`
depending on the data supplied. Use the `downcast` parameter
to obtain other dtypes.

Please note that precision loss may occur if really large numbers
are passed in. Due to the internal limitations of `ndarray`, if
numbers smaller than `-9223372036854775808` (np.iinfo(np.int64).min)
or larger than `18446744073709551615` (np.iinfo(np.uint64).max) are
passed in, it is very likely they will be converted to float so that
they can be stored in an `ndarray`. These warnings apply similarly to
`Series` since it internally leverages `ndarray`.

Parameters
----------
arg : scalar, list, tuple, 1-d array, or Series
    Argument to be converted.
errors : {'ignore', 'raise', 'coerce'}, default 'raise'
    - If 'raise', then invalid parsing will raise an exception.
    - If 'coerce', then invalid parsing will be set as NaN.
    - If 'ignore', then invalid parsing will return the input.

    .. versionchanged:: 2.2

    "ignore" is deprecated. Catch exceptions explicitly instead.

downcast : str, default None
    Can be 'integer', 'signed', 'unsigned', or 'float'.
    If not None, and if the data has been successfully cast to a
    numerical dtype (or if the data was numeric to begin with),
    downcast that resulting data to the smallest numerical dtype
    possible according to the following rules:

    - 'integer' or 'signed': smallest signed int dtype (min.: np.int8)
    - 'unsigned': smallest unsigned int dtype (min.: np.uint8)
    - 'float': smallest float dtype (min.: np.float32)

    As this behaviour is separate from the core conversion to
    numeric values, any errors raised during the downcasting
    will be surfaced regardless of the value of the 'errors' input.

    In addition, downcasting will only occur if the size
    of the resulting data's dtype is strictly larger than
    the dtype it is to be cast to, so if none of the dtypes
    checked satisfy that specification, no downcasting will be
    performed on the data.
dtype_backend : {'numpy_nullable', 'pyarrow'}, default 'numpy_nullable'
    Back-end data type applied to the resultant :class:`DataFrame`
    (still experimental). Behaviour is as follows:

    * ``"numpy_nullable"``: returns nullable-dtype-backed :class:`DataFrame`
      (default).
    * ``"pyarrow"``: returns pyarrow-backed nullable :class:`ArrowDtype`
      DataFrame.

    .. versionadded:: 2.0

Returns
-------
ret
    Numeric if parsing succeeded.
    Return type depends on input.  Series if Series, otherwise ndarray.

See Also
--------
DataFrame.astype : Cast argument to a specified dtype.
to_datetime : Convert argument to datetime.
to_timedelta : Convert argument to timedelta.
numpy.ndarray.astype : Cast a numpy array to a specified type.
DataFrame.convert_dtypes : Convert dtypes.

Examples
--------
Take separate series and convert to numeric, coercing when told to

>>> s = pd.Series(['1.0', '2', -3])
>>> pd.to_numeric(s)
0    1.0
1    2.0
2   -3.0
dtype: float64
>>> pd.to_numeric(s, downcast='float')
0    1.0
1    2.0
2   -3.0
dtype: float32
>>> pd.to_numeric(s, downcast='signed')
0    1
1    2
2   -3
dtype: int8
>>> s = pd.Series(['apple', '1.0', '2', -3])
>>> pd.to_numeric(s, errors='coerce')
0    NaN
1    1.0
2    2.0
3   -3.0
dtype: float64

Downcasting of nullable integer and floating dtypes is supported:

>>> s = pd.Series([1, 2, 3], dtype="Int64")
>>> pd.to_numeric(s, downcast="integer")
0    1
1    2
2    3
dtype: Int8
>>> s = pd.Series([1.0, 2.1, 3.0], dtype="Float64")
>>> pd.to_numeric(s, downcast="float")
0    1.0
1    2.1
2    3.0
dtype: Float32
File:      c:\users\memon\appdata\local\programs\python\python311\lib\site-packages\pandas\core\tools\numeric.py
Type:      function

In [88]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Fname       5 non-null      object
 2   FinalMarks  4 non-null      float64
 3   Grade       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 292.0+ bytes

In [103]:
df2

    Name Fname FinalMarks Grade
0  Ahmed   Ali         80     A
1  Ahmed   Ali         80     A
2  Ahmed   Ali       Fail     A
3  Ahmed   Ali         80     A
4  Ahmed   Ali         80     A

In [104]:
df

        a    b  c    d  e
first   1  2.0  3  4.0  5
second  2  3.0  5  7.0  8

In [114]:
df["f"] = df["a"]+df["c"]

In [116]:
df.shape

(2, 6)

In [117]:
df.size

12

In [118]:
df2

    Name Fname FinalMarks Grade
0  Ahmed   Ali         80     A
1  Ahmed   Ali         80     A
2  Ahmed   Ali       Fail     A
3  Ahmed   Ali         80     A
4  Ahmed   Ali         80     A

In [156]:
df2["Class"] = pd.Series([12,11,10], index= [0,1,4])

In [157]:
df2["FinalMarks"] = pd.to_numeric(df2["FinalMarks"], errors = 'coerce')
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        20 non-null     object
 1   Fname       20 non-null     object
 2   FinalMarks  16 non-null     float64
 3   Grade       20 non-null     object
 4   Class       3 non-null      float64
dtypes: float64(2), object(3)
memory usage: 932.0+ bytes

In [158]:
df2.describe()

       FinalMarks  Class
count   16.000000    3.0
mean    72.500000   11.0
std     15.705625    1.0
min     30.000000   10.0
25%     77.500000   10.5
50%     80.000000   11.0
75%     80.000000   11.5
max     80.000000   12.0

In [127]:
mydf = pd.read_csv("calories.csv")

In [133]:
mydf.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [26]:
mydf

NameError: name 'mydf' is not defined

In [147]:
mydf.describe().loc["count"]

Duration    169.0
Pulse       169.0
Maxpulse    169.0
Calories    164.0
Name: count, dtype: float64

In [144]:
mydf.Duration.mean()

np.float64(63.84615384615385)

In [15]:
my_df = pd.DataFrame([[1,3,4],[5,6,7,8]],columns = ["one","two","three","four"],index = ["A","B"],dtype = float)

In [18]:
my_df.astype({"one":int,"two":int})

   one  two  three  four
A    1    3    4.0   NaN
B    5    6    7.0   8.0

In [19]:
my_df

   one  two  three  four
A  1.0  3.0    4.0   NaN
B  5.0  6.0    7.0   8.0

In [20]:
my_df1 = pd.DataFrame([{"Name":"Corolla","Company":"Toyota","Model":"2010","Varient": "GLI"},
                      {"Name":"Corolla1","Company":"Toyota","Model":"2010","Varient": "GLI"},
                      {"Name":"Corolla2","Company":"Toyota","Model":"2010","Varient": "GLI"},
                      {"Name":"Corolla3","Company":"Toyota","Model":"2010","Varient": "GLI"},
                      {"Name":"Corolla4","Company":"Toyota","Model":"2010","Varient": "GLI"}])

In [21]:
my_df1

       Name Company Model Varient
0   Corolla  Toyota  2010     GLI
1  Corolla1  Toyota  2010     GLI
2  Corolla2  Toyota  2010     GLI
3  Corolla3  Toyota  2010     GLI
4  Corolla4  Toyota  2010     GLI

In [22]:
student = [{"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
          {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":30,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":40,"Grade":"A"},
          {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":60,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":70,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":"Fail","Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"},
           {"Name":"Ahmed","Fname":"Ali","FinalMarks":80,"Grade":"A"}]

In [51]:
student_df = pd.DataFrame(student)
student_df

     Name Fname FinalMarks Grade
0   Ahmed   Ali         80     A
1   Ahmed   Ali         80     A
..    ...   ...        ...   ...
18  Ahmed   Ali         80     A
19  Ahmed   Ali         80     A

[20 rows x 4 columns]

In [52]:
student_df.shape

(20, 4)

In [53]:
student_df["FinalMarks"] = pd.to_numeric(student_df["FinalMarks"], errors= "coerce")

In [61]:
student_df.describe()

       FinalMarks
count   16.000000
mean    72.500000
std     15.705625
min     30.000000
25%     77.500000
50%     80.000000
75%     80.000000
max     80.000000

In [62]:
customers = pd.read_csv("week 17 dataset/customers.csv")

In [67]:
customers.tail(10)

    customer_id        name  age  gender                  city
490       C0491       Tyler   33  Female  East Samanthaborough
491       C0492     Douglas   19    Male          Jonathanport
492       C0493  Kristopher   45  Female             Brownfort
493       C0494      Kristi   49  Female           South Jamie
494       C0495      Austin   44    Male              Mikeside
495       C0496   Stephanie   37    Male            Santosport
496       C0497       Susan   41    Male              Annaside
497       C0498     Spencer   29  Female            Harrisside
498       C0499      Rachel   52    Male          Anthonymouth
499       C0500     Jasmine   50    Male            North Mark

In [97]:
d = customers.describe()
d

              age
count  500.000000
mean    41.278000
std     13.389072
min     18.000000
25%     30.000000
50%     42.000000
75%     52.000000
max     64.000000

In [102]:
d.loc["50%"]

age    42.0
Name: 50%, dtype: float64

# Task Ecommerce

- A Complete Annual Report for every year (Total sale, Most sailing category, most sailing product)
- A Complete Monthly Report for every month of every year (Total sale, Most sailing category, most sailing product)
- Most re-visited customers
- Most sailing category in complete 3 years
- Most sailing product in complete 3 years
- List of all categories
- Names of customers who had spended more than 2000$ on our store
- no of customers below 30, 50, 80 on every categories

In [137]:
customers[customers["age"]<50].reset_index().loc[3,"name"]

'Oscar'

In [122]:
below_

     index customer_id        name
0        4       C0005      Taylor
1        9       C0010  Jacqueline
2       10       C0011       Sarah
3       15       C0016    Danielle
4       17       C0018     Timothy
..     ...         ...         ...
116    484       C0485     Cameron
117    485       C0486     Jasmine
118    487       C0488       Jacob
119    491       C0492     Douglas
120    497       C0498     Spencer

[121 rows x 3 columns]

In [138]:
orders = pd.read_csv("week 17 dataset/orders.csv")

In [142]:
orders.customer_id.value_counts()

customer_id
C0028    13
C0113    13
C0243    12
C0475    11
C0108    11
         ..
C0279     1
C0260     1
C0152     1
C0400     1
C0263     1
Name: count, Length: 498, dtype: int64

In [143]:
products = pd.read_csv("week 17 dataset/products.csv")

In [145]:
products["category"].unique()

array(['Clothing', 'Accessories', 'Home', 'Footwear', 'Electronics'],
      dtype=object)

In [150]:
category_count = products["category"].value_counts()
category_count

category
Electronics    22
Clothing       21
Accessories    21
Footwear       19
Home           17
Name: count, dtype: int64

In [151]:
category_count["Footwear"]

np.int64(19)

In [155]:
orders["order_date"] = pd.to_datetime(orders["order_date"])

In [156]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2584 entries, 0 to 2583
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     2584 non-null   object
 1   customer_id  2584 non-null   object
 2   product_id   2584 non-null   object
 3   quantity     2584 non-null   int64
 4   order_date   2584 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 101.1+ KB

In [157]:
orders_2022 = orders[orders["order_date"].dt.year == 2022]

In [162]:
orders["order_date"].dt.year.unique?

Object `unique` not found.

In [ ]:
pd.options.display.max_rows = 10